[
    {
        "id": 1,
        "title": "Shinji Ikari",
        "race": "Human",
        "affiliation": "NERV",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/shinji_ikari.png"
    },
    {
        "id": 2,
        "title": "Rei Ayanami",
        "race": "Clone",
        "affiliation": "NERV",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/rei_ayanami.png"
        
    },
    {
        "id": 3,
        "title": "Asuka Langley Soryu",
        "race": "Human",
        "affiliation": "NERV",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/auska.png",
        "backgroundImage": "https://i.pinimg.com/originals/88/d8/47/88d847a2d8675fd2fcc2506170978f68.png",
        "description":"Asuka is one-quarter Japanese. Asuka is a native of Germany, having been raised there, though her nationality is American. Asuka's native language is German, and in both the series and the manga she tends to curse in German. Asuka was born to an American father, known only as Mr. Langley, and a German-Japanese mother, Kyoko Zeppelin Sohryu. In addition, she also has a step-mother, Langley's second wife. She is a child prodigy and has earned a university degree in an unspecified field as a teenager; she also speaks fluent Japanese, but has trouble reading and writing kanji. Asuka had years of training starting from a young age to become a pilot for the Evangelion. Asuka is very proud of being an Eva pilot, and near-constantly wears her A10 nerve clips in her hair because she wants everyone around her to know that she is a pilot. Asuka's iconic catch-phrase (always directed at Shinji) was 'anta baka?!' ('あんたバカァ?!?'), 'anta' being a contraction of 'anata' meaning 'you' and 'baka' literally meaning 'fool' or 'idiot'. The official English voice recording renders this as 'What are you, stupid?!' Character designer Yoshiyuki Sadamoto explained that he 'first designed an Asuka-type girl as the lead character', but felt it might be too similar to previous anime that he and Anno had worked on, such as Gunbuster and Nadia. He suggested to Anno that they change the lead character to a boy, which would be more in keeping with the robot genre. In the initial project, she was described as 'a determined girl' who adapts to the situation in which she finds herself, passionate about video games and 'aspires to become like Ryoji Kaji'. In the nineteenth episode, she would have had to be seriously injured in her attempt to protect Shinji, who would have thus 'proved his worth' trying to save her. As Sadamoto and Anno designed the series, Sadamoto came to believe that Asuka would occupy the position of an 'idol' in the Eva world. Asuka should have represented '[Shinji's] desire for the female sex', as opposed to Rei Ayanami's 'motherhood', and would have been 'the idol of Neon Genesis Evangelion'. He also described his belief that the relationship between Asuka and Shinji would be similar to the relationship between Jean, Nadia's love interest and eventual husband in the earlier Nadia. Asuka's personality, as well as those of the other characters, was designed so as to be understood at a glance. Anno also thought of her as a Nadia with a different hairstyle. During most of the series, she is 13 years old, younger than Shinji by almost half a year.",
        "weight":"46kg",
        "blood": "A",
        "rank": "Second Child",
        "age": "14 (born December 04, 2001 (Sagittarius)[1])",
        "gallery": [ "https://i.pinimg.com/564x/1e/63/cd/1e63cd4b704c353b8d014f8660a31f65.jpg",
        "https://i.pinimg.com/originals/11/a8/c1/11a8c14bb717b86f7a0841111b1d8450.gif",
        "https://i.pinimg.com/originals/bf/4e/5e/bf4e5e73a2856f001677c3761392e245.jpg",
        "https://i.pinimg.com/originals/90/66/30/906630ecbfa6e69128d5ea98892955ee.gif"]
    },
    {
        "id": 4,
        "title": "Kaworu Nagisa",
        "race": "Angel",
        "affiliation": "NERV, SEELE, angel",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/kaoru_nagisa.png"
    },
    {
        "id": 5,
        "title": "Toji Suzuhara",
        "race": "Human",
        "affiliation": "NERV",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/touji_suzuhara.png"
    },
    {
        "id": 6,
        "title": "Mari Makinami Illustrious",
        "race": "Human",
        "affiliation": "IPEA, WILLE",
        "imageUrl": ""
    },
    {
        "id": 7,
        "title": "Gendou Ikari",
        "race": "Human",
        "affiliation": "NERV",
        "imageUrl": "https://images.freeimages.com/fic/images/icons/1373/if_evangelion/32/gendou_ikari.png"
    }
]